app/views/books/_index.html.erb

        <td id="favorite-btn-<%= book.id %>"><%= render partial: "favorites/favorite-btn", locals: { book: book} %></td>
        <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books" WHERE (title LIKE '%a%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]