app/views/books/show.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <td id="favorite-btn-<%= @book.id %>"><%= render partial: "favorites/favorite-btn", locals: { book: @book} %></td>
          <td>コメント数: <%= @book.book_comments.count %></td>