app/controllers/users_controller.rb

  def following
   @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def follower
   @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "gh"], ["profile_image_id", nil], ["updated_at", "2021-05-05 08:42:06.443232"], ["id", 1]]